[
  {
    "id": "what-is-apper",
    "title": "What is Apper?",
    "subtitle": "Provide a concise and engaging introduction to Apper, explaining its purpose and target audience",
    "icon": "Brain",
    "sections": [
      {
        "type": "text",
        "content": "Apper is your AI app creator. It's not just powered by AI — it is AI. Kind of like ChatGPT, but instead of giving you answers, Apper builds fully functional apps based on your inputs in a few minutes."
      },
      {
        "type": "text",
        "content": "You don't need to write code, pick design templates, or juggle multiple tools to handle different parts of an app. With Apper, everything happens in one place, all through a simple conversation (chat interface)."
      },
      {
        "type": "text",
        "content": "Just chat with Apper (in your simple, everyday English) and tell it what kind of app you need. It builds and improves your app instantly based on your chat inputs."
      },
      {
        "type": "text",
        "content": "In short, Apper is the simplest way to build complete, functional apps — just by having a conversation with AI."
      },
      {
        "type": "list",
        "heading": "What makes Apper special:",
        "items": [
          "Natural language interface - just talk to describe your app",
          "Instant app generation from your descriptions",
          "Beautiful, responsive designs automatically created",
          "Powerful features without technical complexity",
          "Cloud-hosted with automatic scaling",
          "Works on desktop, tablet, and mobile devices"
        ]
      }
    ]
  },
  {
    "id": "why-apper-stands-out",
    "title": "Why Apper Stands Out",
    "subtitle": "Highlight the key features and benefits of Apper that differentiate it from competitors. Focus on unique selling points and value proposition",
    "icon": "Sparkles",
    "sections": [
      {
        "type": "text",
        "content": "Most tools help with only one part of building an app. You might use one for design, another for databases, something else for login, payments, hosting, testing, & more."
      },
      {
        "type": "text",
        "content": "With Apper, everything happens in one place. The AI builds your app from start to finish:"
      },
      {
        "type": "list",
        "items": [
          "Pages and layouts",
          "Buttons and forms",
          "How your app behaves",
          "Where the data goes",
          "How users log in",
          "How do you get paid",
          "And more — all set up and ready to use"
        ]
      },
      {
        "type": "text",
        "content": "What truly sets Apper apart is how natural it feels. You just speak with Apper in your plain everyday language, and it understands what to build, how it should look, and how it should work."
      },
      {
        "type": "text",
        "content": "That's why Apper isn't just another app builder — it's a new way to create software."
      }
    ]
  },
  {
    "id": "what-you-can-build",
    "title": "What You Can Build",
    "subtitle": "Showcase the types of applications that can be created using Apper, providing examples and use cases",
    "icon": "Lightbulb",
    "sections": [
      {
        "type": "text",
        "content": "Apper lets you build almost any app, website, or digital product — just describe it and it builds it for you."
      },
      {
        "type": "list",
        "heading": "Internal Business Tools:",
        "items": [
          "Create apps for internal use by you and your teams — like CRMs, project management systems, HR system, and sales dashboards."
        ]
      },
      {
        "type": "list",
        "heading": "Customer-Facing Apps:",
        "items": [
          "Build apps your users can log into — like booking platforms, client portals, habit trackers, or lead capture tools."
        ]
      },
      {
        "type": "list",
        "heading": "SaaS Products:",
        "items": [
          "Launch full software products people can subscribe to — with logins, payment plans, user roles, and usage tracking."
        ]
      },
      {
        "type": "list",
        "heading": "Websites:",
        "items": [
          "Create stunning websites in minutes — from landing pages and personal portfolios to blogs and membership sites."
        ]
      },
      {
        "type": "list",
        "heading": "Online Stores:",
        "items": [
          "Set up a complete online shop — with product listings, Stripe payments, carts, discounts, and order management."
        ]
      },
      {
        "type": "list",
        "heading": "Games & Interactive Apps:",
        "items": [
          "Build fun and engaging apps — like quizzes, puzzles, learning games, tap-to-win challenges, or daily streak trackers."
        ]
      },
      {
        "type": "list",
        "heading": "Databases & Admin Panels:",
        "items": [
          "Manage your data behind the scenes — with editable tables, filters, role-based access, and connected dashboards."
        ]
      },
      {
        "type": "list",
        "heading": "Anything You Can Imagine:",
        "items": [
          "From mood journals to quiz makers and mini social hubs — if you can describe it, Apper can build it."
        ]
      }
    ]
  },
  {
    "id": "create-your-first-app",
    "title": "Create Your First App",
    "subtitle": "Offer a step-by-step guide to creating a basic application using Apper, including clear instructions and screenshots",
    "icon": "Rocket",
    "sections": [
      {
        "type": "text",
        "content": "When you log in to Apper, you'll see a large prompt box in the center of the screen. This is where you tell Apper what kind of app you want to build, just like you're explaining it to a friend."
      },
      {
        "type": "list",
        "heading": "Example prompts to try:",
        "items": [
          "\"I want to build a tool to track customer orders.\"",
          "\"Make an app where users can book sessions and pay online.\"",
          "\"Create a quiz game that gives points and tracks team progress.\""
        ]
      },
      {
        "type": "text",
        "content": "But to help Apper understand your idea more clearly, we strongly recommend refining your prompt first with ChatGPT. Here's how to do it:"
      },
      {
        "type": "list",
        "heading": "Step-by-Step: How to Write a Better Prompt with ChatGPT:",
        "items": [
          "Open ChatGPT in a new tab.",
          "Copy and paste the following prompt into ChatGPT: \"I want to build [Insert your app idea here]. Rewrite this as a detailed prompt focused on the app's main function and detailed features. It should be simple, clear, easy to understand, and ready to use in an AI app creator.\"",
          "Replace the part that says [Insert your app idea here] with your actual idea. For example: I want to build an app that helps users book yoga classes and pay online.",
          "ChatGPT will rewrite your idea into a cleaner, more detailed prompt.",
          "Copy the improved version ChatGPT gives you, and paste it into the Apper prompt box.",
          "This will give you a much better starting point. Using this prompt, Apper will be able to generate your app more accurately based on your needs."
        ]
      }
    ]
  },
  {
    "id": "your-app-is-being-built",
    "title": "Your App Is Being Built...",
    "subtitle": "Explain the app building process and provide visual feedback to the user during this stage",
    "icon": "Loader",
    "sections": [
      {
        "type": "text",
        "content": "Once you submit your prompt, Apper starts building your app immediately. You'll see real-time progress as your app comes to life."
      },
      {
        "type": "text",
        "content": "During this process, Apper is:"
      },
      {
        "type": "list",
        "items": [
          "Analyzing your requirements and understanding your vision",
          "Creating the database structure for your app's data",
          "Designing the user interface and layouts",
          "Building the functionality and features you requested",
          "Setting up navigation and user flows",
          "Configuring security and access controls"
        ]
      },
      {
        "type": "text",
        "content": "This usually takes just a few minutes, depending on the complexity of your app. You can watch the progress and see your app taking shape in real-time."
      }
    ]
  },
  {
    "id": "your-app-first-version-ready",
    "title": "Your App's First Version Is Ready 🎉",
    "subtitle": "Celebrate the successful completion of the app building process and provide instructions on how to access and use the app",
    "icon": "Trophy",
    "sections": [
      {
        "type": "text",
        "content": "Congratulations! Your app's first version is now ready. You can immediately start using it, testing it, and sharing it with others."
      },
      {
        "type": "text",
        "content": "Once you submit your prompt, you'll be redirected to the 'Apper Builder Interface'. The Apper Builder Interface has 4 main sections:"
      },
      {
        "type": "list",
        "heading": "Main Interface Sections:",
        "items": [
          "Customize App: View and edit your app's layout, pages, and components.",
          "Manage App: Control your app's settings, invite users, set up permissions, onboarding emails, and billing for your app.",
          "Code: View or edit the code behind your app if you're working with a developer and want advanced customization. Important Note: No coding is required to use Apper; this is just for added flexibility.",
          "Database: It's where your app safely stores and manages all its data. This could be anything from user details, form submissions, product lists, bookings, messages, or any data your app needs to deal with."
        ]
      },
      {
        "type": "text",
        "content": "Apper takes care of everything automatically: Analyzes your app, Creates the right tables for your app's data, Links related info together (like connecting a user to their orders), and Keeps everything updated in real time with your app's screens."
      },
      {
        "type": "text",
        "content": "So when someone adds, edits, or views something in your app, the database is always working quietly in the background to make it all run smoothly."
      }
    ]
  },
  {
    "id": "how-to-edit-modify-add-features",
    "title": "How to Edit, Modify, or Add New Features to Your App",
    "subtitle": "Guide users on how to customize and enhance their app with additional features and modifications",
    "icon": "Edit",
    "sections": [
      {
        "type": "text",
        "content": "One of Apper's greatest strengths is how easy it is to modify and improve your app. You don't need to start over or learn complex tools — just continue the conversation."
      },
      {
        "type": "text",
        "content": "To make changes to your app, simply use the chat interface to describe what you want to modify, add, or remove."
      },
      {
        "type": "list",
        "heading": "Examples of modifications you can request:",
        "items": [
          "\"Add a new page for user profiles\"",
          "\"Change the color scheme to blue and white\"",
          "\"Add a payment integration with Stripe\"",
          "\"Create a dashboard with analytics\"",
          "\"Add email notifications for new orders\"",
          "\"Make the design more mobile-friendly\"",
          "\"Add a search function to the product list\"",
          "\"Create user roles with different permissions\""
        ]
      },
      {
        "type": "text",
        "content": "Apper will understand your request and implement the changes immediately. You can see the updates in real-time and continue refining until your app is exactly what you want."
      },
      {
        "type": "list",
        "heading": "Tips for effective modifications:",
        "items": [
          "Be specific about what you want to change",
          "Test each change before requesting the next one",
          "Use the preview feature to see how changes look",
          "Don't hesitate to ask for adjustments if something isn't quite right"
        ]
      }
    ]
  },
  {
    "id": "troubleshooting-errors",
    "title": "Troubleshooting Errors",
    "subtitle": "Provide a comprehensive list of common errors and their solutions, helping users resolve issues they may encounter while using Apper",
    "icon": "AlertCircle",
    "sections": [
      {
        "type": "text",
        "content": "While Apper is designed to work smoothly, you might occasionally encounter issues. Here's how to handle the most common situations."
      },
      {
        "type": "list",
        "heading": "Common Issues and Solutions:",
        "items": [
          "Build Failed: If you see \"Build was unsuccessful,\" click \"Fix It Now\" and Apper will automatically resolve the issue",
          "App Not Loading: Refresh your browser or try opening the app in a new tab",
          "Features Not Working: Make sure you've saved your changes and the app has finished updating",
          "Login Issues: Check your internet connection and try clearing your browser cache",
          "Missing Data: Verify that your database connections are properly configured"
        ]
      },
      {
        "type": "text",
        "content": "If something goes wrong during setup, you might see a message saying \"Build was unsuccessful.\" Don't worry — you don't need to debug anything yourself. Just click \"Fix It Now\" and Apper will automatically take care of the issue for you."
      },
      {
        "type": "text",
        "content": "Once it's fixed, your app will reload, and you can continue building right where you left off."
      },
      {
        "type": "list",
        "heading": "Prevention Tips:",
        "items": [
          "Make one change at a time to avoid conflicts",
          "Test your app regularly during development",
          "Keep your browser updated for the best experience",
          "Use clear, specific language when describing changes",
          "Save your work frequently"
        ]
      },
      {
        "type": "text",
        "content": "If you continue to experience issues, you can always reach out to Apper support for personalized assistance."
      }
    ]
  }
]