[
  {
    "id": "what-is-apper",
    "title": "What is Apper? 🚀",
    "subtitle": "Discover the power of no-code development",
    "icon": "Zap",
    "sections": [
      {
        "heading": "What is Apper",
        "type": "text",
        "content": "Apper is your AI app creator! It's not just powered by AI — it is AI. Kind of like ChatGPT, but instead of giving you answers, Apper builds fully functional apps based on your inputs in a few minutes!"
      },
      {
        "heading": "How Apper Works",
        "type": "text",
        "content": "You don't need to write code, pick design templates, or juggle multiple tools to handle different parts of an app. With Apper, everything happens in one place, all through a simple conversation (chat interface)."
      },
      {
        "heading": "🌟 Key Benefits",
        "type": "list",
        "items": [
          "Chat in simple, everyday English to describe your app idea",
          "Get fully functional apps built in just a few minutes",
          "No coding, designing, or technical skills required",
          "Everything happens in one unified platform",
          "Apps improve instantly based on your feedback",
          "Complete control through natural conversation"
        ]
      },
      {
        "heading": "💡 Getting Started Tips",
        "type": "list",
        "items": [
          "Start by describing your app idea in simple terms",
          "Be specific about what you want your app to do",
          "Don't worry about technical details - just explain your vision",
          "Ask for changes or improvements anytime during the conversation",
          "Test your app frequently as it's being built"
        ]
      }
    ]
  },
  {
    "id": "why-apper-stands-out",
    "title": "Why Apper Stands Out ⭐",
    "subtitle": "What makes us different from other platforms",
    "icon": "Star",
    "sections": [
      {
        "heading": "Why Apper Stands Out",
        "type": "text",
        "content": "In a crowded market of app-building tools, Apper takes a fundamentally different approach. While others require you to learn their platform, Apper learns from you! It's the difference between speaking a new language and having a conversation in your own words."
      },
      {
        "heading": "What Makes Us Different",
        "type": "text",
        "content": "Unlike traditional no-code platforms that still require you to understand templates, drag-and-drop interfaces, and technical concepts, Apper works purely through natural conversation. You simply describe what you want, and it builds it for you!"
      },
      {
        "heading": "🚀 Key Differentiators",
        "type": "list",
        "items": [
          "Pure AI conversation - no templates or drag-and-drop required",
          "Builds complete, functional apps in minutes, not hours or days",
          "No learning curve - if you can chat, you can build apps",
          "Instant iterations - just ask for changes in plain English",
          "One unified platform - no need to switch between multiple tools",
          "Real-time collaboration through shared conversations",
          "Automatically optimized for all devices and screen sizes",
          "Built-in best practices for performance, security, and accessibility"
        ]
      },
      {
        "heading": "The Apper Advantage",
        "type": "text",
        "content": "Traditional platforms make you adapt to their way of thinking. Apper adapts to yours! Whether you're a business owner with an idea, a designer with a vision, or a developer who wants to prototype quickly, Apper meets you where you are and builds what you need."
      }
    ]
  },
  {
    "id": "what-you-can-build",
    "title": "What You Can Build 🏗️",
    "subtitle": "Endless possibilities with Apper",
    "icon": "Layers",
    "sections": [
      {
        "heading": "Application Types",
        "type": "list",
        "items": [
          "Business websites and landing pages",
          "E-commerce stores and marketplaces",
          "Customer relationship management (CRM) systems",
          "Project management and collaboration tools",
          "Event management and booking systems",
          "Educational platforms and course websites",
          "Portfolio and personal websites",
          "Social networking and community platforms"
        ]
      },
      {
        "heading": "Industry Solutions",
        "type": "text",
        "content": "Apper serves businesses across all industries! From restaurants managing online orders to consultants tracking client projects, from artists showcasing portfolios to nonprofits organizing events - the possibilities are limitless."
      }
    ]
  },
  {
    "id": "create-your-first-app",
    "title": "Create Your First App 🎉",
    "subtitle": "Step-by-step guide to building your first application",
    "icon": "PlusCircle",
    "sections": [
      {
        "heading": "🚀 Getting Started",
        "type": "text",
        "content": "When you log in to Apper, you'll see a large prompt box in the center of the screen. This is where you tell Apper what kind of app you want to build, just like you're explaining it to a friend."
      },
      {
        "heading": "💡 Pro Tip for Better Results",
        "type": "text",
        "content": "This will give you a much better starting point! Using a detailed prompt, Apper will be able to generate your app more accurately based on your needs."
      },
      {
        "type": "steps",
        "heading": "📝 Step-by-Step: How to Write a Better Prompt with ChatGPT",
        "steps": [
          {
            "title": "Open ChatGPT in a new tab",
            "description": "Navigate to ChatGPT in your browser to start refining your prompt."
          },
          {
            "title": "Copy and paste the following prompt into ChatGPT",
            "description": "\"I want to build [Insert your app idea here]. Rewrite this as a detailed prompt focused on the app's main function and detailed features. It should be simple, clear, easy to understand, and ready to use in an AI app creator.\""
          },
          {
            "title": "Replace the placeholder with your actual idea",
            "description": "Replace the part that says [Insert your app idea here] with your actual idea. For example: I want to build an app that helps users book yoga classes and pay online."
          },
          {
            "title": "Get the improved version from ChatGPT",
            "description": "ChatGPT will rewrite your idea into a cleaner, more detailed prompt."
          },
          {
            "title": "🚀 Copy and paste into Apper",
            "description": "Copy the improved version ChatGPT gives you, and paste it into the Apper prompt box. You're ready to build!"
          }
        ]
      }
    ]
  },
  {
    "id": "app-being-built",
    "title": "Your App Is Being Built... 🔨",
    "subtitle": "Watch as Apper creates your app in real-time with intelligent progress updates",
    "icon": "Loader",
    "sections": [
      {
        "type": "text",
        "content": "In the center of the screen, you'll see a friendly message letting you know that your app is being set up. You don't have to do anything just yet — Apper is preparing everything for you automatically."
      },
      {
        "heading": "Real-Time Progress Updates",
        "type": "text",
        "content": "Meanwhile, you'll see a message in the left-hand chat interface that walks you through what's happening, something like:"
      },
      {
        "type": "list",
        "items": [
          "🔍 Analyzing your request and breaking it into clear features",
          "⚙️ Setting up the right components, pages, and workflows",
          "🎨 Building an intuitive, responsive interface",
          "🚀 Preparing a first version focused on your core idea"
        ]
      },
      {
        "type": "text",
        "content": "This chat updates as progress is made! You can even interact with it and ask for tweaks, request additions, or just sit back and watch things come together."
      }
    ]
  },
  {
    "id": "first-version-ready",
    "title": "Your App's First Version Is Ready 🎉",
    "subtitle": "Explore your newly created app and see what Apper has built for you",
    "icon": "Sparkles",
    "sections": [
      {
        "type": "text",
        "content": "Once the setup is complete, your app's first version appears right on the dashboard!"
      },
      {
        "heading": "What You Can Expect",
        "type": "list",
        "items": [
          "✅ Some parts of your app are already working and clickable; you can explore and check them out",
          "Others are just visual for now — they'll come to life as you add more logic",
          "You can explore the app layout, click around, and get a feel for what's been generated so far"
        ]
      },
      {
        "type": "text",
        "content": "This is your starting point - a solid foundation that you can build upon and customize to match your exact vision!"
      }
    ]
  },
  {
    "id": "edit-and-modify",
    "title": "How to Edit, Modify, or Add New Features to Your App 🔧",
    "subtitle": "Use the AI chat assistant to continuously improve and expand your app",
    "icon": "MessageSquare",
    "sections": [
      {
        "type": "text",
        "content": "On the left-hand side, you'll see the Apper AI chat assistant! This is where you can keep building your app, just by having a conversation."
      },
      {
        "heading": "✨ Making Changes is Simple",
        "type": "text",
        "content": "You can type exactly what you want next! For example:"
      },
      {
        "type": "list",
        "items": [
          "\"Add a page to manage bookings.\"",
          "\"Make the save button actually store data.\"",
          "\"Each button should be large, with both an icon and text for clarity.\""
        ]
      },
      {
        "type": "text",
        "content": "Or, if you're not sure what to do next, just click one of the suggestions the assistant has already listed in the chat!"
      },
      {
        "heading": "⚡ Instant Updates",
        "type": "text",
        "content": "Apper will immediately start updating your app based on your input! Explore, customize, and keep building — all right from the same screen."
      }
    ]
  },
{
    "id": "troubleshooting-errors",
    "title": "What to do when you encounter build issues 🛠️",
    "subtitle": "Quick solutions for common setup problems",
    "icon": "AlertCircle",
    "sections": [
      {
        "heading": "What If You Encounter an Error",
        "type": "text",
        "content": "If something goes wrong during setup, you might see a message saying \"Build was unsuccessful.\""
      },
      {
        "heading": "No Need to Worry",
        "type": "text",
        "content": "Don't worry — you don't need to debug anything yourself. Just click \"Fix It Now\" and Apper will automatically take care of the issue for you. Once it's fixed, your app will reload, and you can continue building right where you left off."
      }
    ]
  },
  {
    "id": "app-versions",
    "title": "App Versions 📚",
    "subtitle": "Managing different versions of your application",
    "icon": "GitBranch",
    "sections": [
      {
        "heading": "Version Control",
        "type": "text",
        "content": "Apper automatically saves versions of your app as you work! This allows you to revert to previous states if needed. You can also create manual save points before making major changes."
      },
      {
        "heading": "⚙️ Version Features",
        "type": "list",
        "items": [
          "Automatic daily backups of your app",
          "Manual save points for major milestones",
          "Compare different versions side by side",
          "Restore any previous version with one click",
          "Branch versions for testing new features",
          "Merge changes from different versions"
        ]
      }
    ]
  },
  {
    "id": "mobile-vs-desktop-preview",
    "title": "Mobile vs Desktop Preview 📱💻",
    "subtitle": "Ensuring your app works perfectly on all devices",
    "icon": "Smartphone",
    "sections": [
      {
        "heading": "Responsive Design",
        "type": "text",
        "content": "Every app built with Apper automatically adapts to different screen sizes! Our preview mode lets you see exactly how your app will look on phones, tablets, and desktops."
      },
      {
        "heading": "Preview Options",
        "type": "list",
        "items": [
          "Live preview as you build",
          "Device-specific previews (iPhone, iPad, etc.)",
          "Orientation testing (portrait and landscape)",
          "Performance testing on different devices",
          "Share preview links with others for feedback",
          "Test touch interactions on mobile devices"
        ]
      }
    ]
  },
  {
    "id": "manage-app-settings",
    "title": "Manage App Settings ⚙️",
    "subtitle": "Configure your app's behavior and appearance",
    "icon": "Settings",
    "sections": [
      {
        "heading": "General Settings",
        "type": "text",
        "content": "App settings control how your application behaves and appears to users! From basic information like the app name and description to advanced features like custom domains and analytics."
      },
      {
        "heading": "Available Settings",
        "type": "list",
        "items": [
          "App name, description, and favicon",
          "Custom domain and SSL certificates",
          "SEO settings and meta tags",
          "Google Analytics and tracking codes",
          "User permissions and access controls",
          "Backup and export options"
        ]
      }
    ]
  },
  {
    "id": "onboarding-and-emails",
    "title": "Onboarding and Emails 📧",
    "subtitle": "Engage your users with automated communications",
    "icon": "Mail",
    "sections": [
      {
        "heading": "User Onboarding",
        "type": "text",
        "content": "Great apps guide users through their first experience! Apper provides tools to create welcome sequences, tutorial overlays, and progressive disclosure of features."
      },
      {
        "heading": "📧 Email Features",
        "type": "list",
        "items": [
          "Welcome email sequences for new users",
          "Automated notifications and reminders",
          "Custom email templates with your branding",
          "Integration with popular email services",
          "Analytics on email open rates and clicks",
          "A/B testing for email optimization"
        ]
      }
    ]
  },
  {
    "id": "billing-and-revenue",
    "title": "Billing and Revenue 💰",
    "subtitle": "Monetize your application effectively",
    "icon": "CreditCard",
    "sections": [
      {
        "heading": "Monetization Options",
        "type": "text",
        "content": "Turn your app into a revenue-generating business with Apper's built-in billing and payment processing! Accept one-time payments, recurring subscriptions, or implement complex pricing models."
      },
      {
        "heading": "💰 Revenue Features",
        "type": "list",
        "items": [
          "One-time payments for products or services",
          "Recurring subscription billing",
          "Multiple payment methods (credit cards, PayPal, etc.)",
          "Tax calculation and compliance",
          "Revenue analytics and reporting",
          "Integration with accounting software"
        ]
      }
    ]
  },
  {
    "id": "code-section",
    "title": "Code Section 👨‍💻 (Optional)",
    "subtitle": "For developers who want to extend functionality",
    "icon": "Code",
    "sections": [
      {
        "heading": "Custom Code",
        "type": "text",
        "content": "While Apper is designed for no-code users, developers can add custom HTML, CSS, and JavaScript to extend functionality! This gives you the best of both worlds - visual building with the option for custom code."
      },
      {
        "heading": "💻 Example Custom Component",
        "type": "code",
        "code": "// Custom button with advanced interaction\nfunction CustomButton(props) {\n  const handleClick = () => {\n    // Custom logic here\n    console.log('Button clicked!');\n    props.onCustomAction();\n  };\n\n  return (\n    <button \n      className=\"custom-btn\"\n      onClick={handleClick}\n    >\n      {props.label}\n    </button>\n  );\n}"
      },
      {
        "heading": "🛠️ Advanced Features",
        "type": "list",
        "items": [
          "Custom CSS for unique styling",
          "JavaScript for advanced interactions",
          "API integrations and webhooks",
          "Third-party library integrations",
          "Custom database queries",
          "Advanced form validation"
        ]
      }
    ]
  },
  {
    "id": "database-setup",
    "title": "Database Setup 🗄️",
    "subtitle": "Your app's data management system",
    "icon": "Database",
    "sections": [
      {
        "heading": "Database - Your App's Memory",
        "type": "text",
        "content": "It's where your app safely stores and manages all its data! This could be anything from user details, form submissions, product lists, bookings, messages, or any data your app needs to deal with."
      },
      {
        "heading": "How Apper Handles Your Data Automatically",
        "type": "text",
        "content": "Apper takes care of everything automatically and works quietly in the background to make your app run smoothly!"
      },
      {
        "heading": "🔧 What Apper Does Behind the Scenes",
        "type": "list",
        "items": [
          "Analyzes your app and understands what data it needs",
          "Creates the right tables for your app's data automatically",
          "Links related information together (like connecting a user to their orders)",
          "Keeps everything updated in real time with your app's screens",
          "Ensures data consistency and security at all times",
          "Handles data backup and recovery automatically"
        ]
      },
      {
        "heading": "✨ The Result",
        "type": "text",
        "content": "So when someone adds, edits, or views something in your app, the database is always working quietly in the background to make it all run smoothly! You don't need to worry about technical details - Apper handles it all for you."
      }
    ]
  }
]