[
  {
    "id": "what-is-apper",
    "title": "What is Apper? 🚀",
    "subtitle": "Discover the power of no-code development",
    "icon": "Zap",
    "sections": [
      {
        "heading": "What is Apper",
        "type": "text",
        "content": "Apper is your AI app creator! It's not just powered by AI — it is AI. Kind of like ChatGPT, but instead of giving you answers, Apper builds fully functional apps based on your inputs in a few minutes!"
      },
      {
        "heading": "How Apper Works",
        "type": "text",
        "content": "You don't need to write code, pick design templates, or juggle multiple tools to handle different parts of an app. With Apper, everything happens in one place, all through a simple conversation (chat interface)."
      },
      {
        "heading": "🌟 Key Benefits",
        "type": "list",
        "items": [
          "Chat in simple, everyday English to describe your app idea",
          "Get fully functional apps built in just a few minutes",
          "No coding, designing, or technical skills required",
          "Everything happens in one unified platform",
          "Apps improve instantly based on your feedback",
          "Complete control through natural conversation"
        ]
      },
      {
        "heading": "💡 Getting Started Tips",
        "type": "list",
        "items": [
          "Start by describing your app idea in simple terms",
          "Be specific about what you want your app to do",
          "Don't worry about technical details - just explain your vision",
          "Ask for changes or improvements anytime during the conversation",
          "Test your app frequently as it's being built"
        ]
      }
    ]
  },
  {
    "id": "why-apper-stands-out",
    "title": "Why Apper Stands Out ⭐",
    "subtitle": "What makes us different from other platforms",
    "icon": "Star",
    "sections": [
      {
        "heading": "Why Apper Stands Out",
        "type": "text",
        "content": "In a crowded market of app-building tools, Apper takes a fundamentally different approach. While others require you to learn their platform, Apper learns from you! It's the difference between speaking a new language and having a conversation in your own words."
      },
      {
        "heading": "What Makes Us Different",
        "type": "text",
        "content": "Unlike traditional no-code platforms that still require you to understand templates, drag-and-drop interfaces, and technical concepts, Apper works purely through natural conversation. You simply describe what you want, and it builds it for you!"
      },
      {
        "heading": "🚀 Key Differentiators",
        "type": "list",
        "items": [
          "Pure AI conversation - no templates or drag-and-drop required",
          "Builds complete, functional apps in minutes, not hours or days",
          "No learning curve - if you can chat, you can build apps",
          "Instant iterations - just ask for changes in plain English",
          "One unified platform - no need to switch between multiple tools",
          "Real-time collaboration through shared conversations",
          "Automatically optimized for all devices and screen sizes",
          "Built-in best practices for performance, security, and accessibility"
        ]
      },
      {
        "heading": "The Apper Advantage",
        "type": "text",
        "content": "Traditional platforms make you adapt to their way of thinking. Apper adapts to yours! Whether you're a business owner with an idea, a designer with a vision, or a developer who wants to prototype quickly, Apper meets you where you are and builds what you need."
      }
    ]
  },
  {
    "id": "what-you-can-build",
    "title": "What You Can Build 🏗️",
    "subtitle": "Endless possibilities with Apper",
    "icon": "Layers",
    "sections": [
      {
        "heading": "Application Types",
        "type": "list",
        "items": [
          "Business websites and landing pages",
          "E-commerce stores and marketplaces",
          "Customer relationship management (CRM) systems",
          "Project management and collaboration tools",
          "Event management and booking systems",
          "Educational platforms and course websites",
          "Portfolio and personal websites",
          "Social networking and community platforms"
        ]
      },
      {
        "heading": "Industry Solutions",
        "type": "text",
        "content": "Apper serves businesses across all industries! From restaurants managing online orders to consultants tracking client projects, from artists showcasing portfolios to nonprofits organizing events - the possibilities are limitless."
      }
    ]
  },
  {
    "id": "create-your-first-app",
    "title": "Create Your First App 🎉",
    "subtitle": "Step-by-step guide to building your first application",
    "icon": "PlusCircle",
    "sections": [
      {
        "heading": "🚀 Getting Started",
        "type": "text",
        "content": "When you log in to Apper, you'll see a large prompt box in the center of the screen. This is where you tell Apper what kind of app you want to build, just like you're explaining it to a friend."
      },
      {
        "heading": "💡 Pro Tip for Better Results",
        "type": "text",
        "content": "This will give you a much better starting point! Using a detailed prompt, Apper will be able to generate your app more accurately based on your needs."
      },
      {
        "type": "steps",
        "heading": "📝 Step-by-Step: How to Write a Better Prompt with ChatGPT",
        "steps": [
          {
            "title": "Open ChatGPT in a new tab",
            "description": "Navigate to ChatGPT in your browser to start refining your prompt."
          },
          {
            "title": "Copy and paste the following prompt into ChatGPT",
            "description": "\"I want to build [Insert your app idea here]. Rewrite this as a detailed prompt focused on the app's main function and detailed features. It should be simple, clear, easy to understand, and ready to use in an AI app creator.\""
          },
          {
            "title": "Replace the placeholder with your actual idea",
            "description": "Replace the part that says [Insert your app idea here] with your actual idea. For example: I want to build an app that helps users book yoga classes and pay online."
          },
          {
            "title": "Get the improved version from ChatGPT",
            "description": "ChatGPT will rewrite your idea into a cleaner, more detailed prompt."
          },
          {
            "title": "🚀 Copy and paste into Apper",
            "description": "Copy the improved version ChatGPT gives you, and paste it into the Apper prompt box. You're ready to build!"
          }
        ]
      }
    ]
  },
  {
    "id": "app-being-built",
    "title": "Your App Is Being Built... 🔨",
    "subtitle": "Watch as Apper creates your app in real-time with intelligent progress updates",
    "icon": "Loader",
    "sections": [
      {
        "type": "text",
        "content": "In the center of the screen, you'll see a friendly message letting you know that your app is being set up. You don't have to do anything just yet — Apper is preparing everything for you automatically."
      },
      {
        "heading": "Real-Time Progress Updates",
        "type": "text",
        "content": "Meanwhile, you'll see a message in the left-hand chat interface that walks you through what's happening, something like:"
      },
      {
        "type": "list",
        "items": [
          "🔍 Analyzing your request and breaking it into clear features",
          "⚙️ Setting up the right components, pages, and workflows",
          "🎨 Building an intuitive, responsive interface",
          "🚀 Preparing a first version focused on your core idea"
        ]
      },
      {
        "type": "text",
        "content": "This chat updates as progress is made! You can even interact with it and ask for tweaks, request additions, or just sit back and watch things come together."
      }
    ]
  },
  {
    "id": "first-version-ready",
    "title": "Your App's First Version Is Ready 🎉",
    "subtitle": "Explore your newly created app and see what Apper has built for you",
    "icon": "Sparkles",
    "sections": [
      {
        "type": "text",
        "content": "Once the setup is complete, your app's first version appears right on the dashboard!"
      },
      {
        "heading": "What You Can Expect",
        "type": "list",
        "items": [
          "✅ Some parts of your app are already working and clickable; you can explore and check them out",
          "Others are just visual for now — they'll come to life as you add more logic",
          "You can explore the app layout, click around, and get a feel for what's been generated so far"
        ]
      },
      {
        "type": "text",
        "content": "This is your starting point - a solid foundation that you can build upon and customize to match your exact vision!"
      }
    ]
  },
  {
    "id": "edit-and-modify",
    "title": "How to Edit, Modify, or Add New Features to Your App 🔧",
    "subtitle": "Use the AI chat assistant to continuously improve and expand your app",
    "icon": "MessageSquare",
    "sections": [
      {
        "type": "text",
        "content": "On the left-hand side, you'll see the Apper AI chat assistant! This is where you can keep building your app, just by having a conversation."
      },
      {
        "heading": "✨ Making Changes is Simple",
        "type": "text",
        "content": "You can type exactly what you want next! For example:"
      },
      {
        "type": "list",
        "items": [
          "\"Add a page to manage bookings.\"",
          "\"Make the save button actually store data.\"",
          "\"Each button should be large, with both an icon and text for clarity.\""
        ]
      },
      {
        "type": "text",
        "content": "Or, if you're not sure what to do next, just click one of the suggestions the assistant has already listed in the chat!"
      },
      {
        "heading": "⚡ Instant Updates",
"type": "text",
        "content": "Apper will immediately start updating your app based on your input! Explore, customize, and keep building — all right from the same screen."
      }
    ]
  },
  {
    "id": "troubleshooting-errors",
    "title": "What to do when you encounter build issues 🛠️",
    "subtitle": "Quick solutions for common setup problems",
    "icon": "AlertCircle",
    "sections": [
      {
        "heading": "What If You Encounter an Error",
        "type": "text",
        "content": "If something goes wrong during setup, you might see a message saying \"Build was unsuccessful.\""
      },
      {
        "heading": "No Need to Worry",
        "type": "text",
        "content": "Don't worry — you don't need to debug anything yourself. Just click \"Fix It Now\" and Apper will automatically take care of the issue for you. Once it's fixed, your app will reload, and you can continue building right where you left off."
      }
    ]
  },
  {
    "id": "desktop-mobile-views",
    "title": "Switch Between Desktop and Mobile Views",
    "subtitle": "Preview your app across different devices",
    "icon": "Monitor",
    "sections": [
      {
        "type": "text",
        "content": "Want to see how your app looks on different devices? Use the view toggle buttons at the top right of the screen (just beside the refresh icon)."
      },
      {
        "type": "list",
        "items": [
          "🖥️ Click the desktop icon to view how your app appears on larger screens",
          "📱 Click the mobile icon to instantly switch to a phone-sized preview",
          "This helps you make sure your app looks great and works smoothly across all screen sizes (no surprises later)",
          "You can switch views anytime while editing or previewing your app"
        ]
      },
      {
        "type": "text",
        "content": "Alternatively, you can also click the View App (or Live Preview) button (positioned right next to the view toggle buttons) to open a full-sized version of your app in a new tab. This will show exactly how your users will see your app."
      }
    ]
  },
  {
    "id": "version-management",
    "title": "Version Management 📊",
    "subtitle": "Track and manage your app versions",
    "icon": "GitBranch",
    "sections": [
      {
        "heading": "Loading and Navigation",
        "type": "text",
        "content": "Click on any version to load it — the app will automatically re-initialize with that version's state. You can also scroll through your chat history on the left to find previous versions."
      },
      {
        "heading": "What Each Version Includes",
        "type": "list",
        "items": [
          "A summary of what changed",
          "A Preview button to view it",
          "A Restore button to bring it back instantly"
        ]
      },
      {
        "heading": "Benefits of Version Management",
"type": "text",
        "content": "This makes it easy to test ideas, fix mistakes, or roll back to a version that worked — anytime you need."
      }
    ]
  },
  {
    "id": "manage-your-app",
    "title": "Manage Your App ⚙️",
    "subtitle": "Essential app management and configuration",
    "icon": "Settings",
"sections": [
      {
        "type": "text",
        "content": "Now that your app is almost ready, it's time to take care of a few essentials, like what your app is called, who can access it, how people sign up, how to charge users, and more."
      },
      {
        "type": "text", 
        "content": "You'll find all of these in the 'Manage App' section. Let's get started."
      },
      {
        "heading": "Rename Your App in Apper",
        "type": "text",
        "content": "As your app starts to take shape, it's a good idea to give it a proper name — one that accurately reflects what it does."
      },
      {
        "type": "text",
        "content": "Apper makes this easy. You can update your app's name anytime from the 'Manage App' settings in the top menu bar, no complicated setup needed."
      }
    ]
  },
  {
    "id": "user-login-signup",
    "title": "Let Users Log In and Sign Up 🔐",
    "subtitle": "Set up user authentication and account management",
    "icon": "UserPlus",
    "sections": [
      {
        "type": "text",
        "content": "If you want users to create accounts, log in, or access premium features of your app, you'll need to set up Login and Signup."
      },
      {
        "type": "text",
        "content": "Apper makes this really easy. You can let users:"
      },
      {
        "type": "list",
        "items": [
          "Sign up with your email and password",
          "Log in with Google",
          "Use Facebook to sign in"
        ]
      },
      {
        "heading": "Choose Whether Users Can Log In via Email or Phone Number",
        "type": "text",
        "content": "You can decide how users log in — using an email address, a phone number, or both."
      },
      {
        "type": "text",
        "content": "This lets you choose what's easiest for your audience, whether it's international users, mobile-first users, or businesses."
      },
      {
        "heading": "Set Up Email Verification",
        "type": "text",
        "content": "If you're using email-based login, you can turn on email verification to confirm that users are signing up with real email addresses."
      },
      {
        "type": "text",
        "content": "This adds an extra layer of trust and helps you avoid fake or mistyped accounts."
      },
      {
        "type": "text",
        "content": "When enabled, users will receive a verification link in their email after signing up. They'll need to click the verification link to access your app."
      },
      {
        "heading": "Set Password Rules for Better Security and User Experience",
        "type": "text",
        "content": "When you allow email or phone login, you can define what kind of passwords users need to create."
      },
      {
        "type": "text",
        "content": "For example, you can:"
      },
      {
        "type": "list",
        "items": [
          "Set a minimum number of characters",
          "Require symbols or numbers",
          "Let users reset passwords easily, & more"
        ]
      },
      {
        "type": "text",
        "content": "This helps you keep accounts safe while making the login setup smooth for users."
      },
      {
        "heading": "Let Users Sign In with Google or Facebook",
        "type": "text",
        "content": "To let users sign in with their Google or Facebook account, you need to connect your app to those platforms."
      },
      {
        "type": "text",
        "content": "Apper gives you 2 ways to make this work:"
      },
      {
        "heading": "Option 1: Use the Default Setup (Simple and automatic)",
        "type": "text",
        "content": "When you turn the 'Use Default Credentials' toggle on, Apper uses a secure connection it has already set up with Google and Facebook."
      },
      {
        "type": "text",
        "content": "Users can still log in with just a click, but the login screen will show Apper's name instead of yours. That's because you're using Apper's shared connection, not your own."
      },
      {
        "type": "text",
        "content": "This is ideal for testing, prototyping, or if you don't need custom branding yet."
      },
      {
        "heading": "Option 2: Use Your Own Setup (For custom branding and control)",
        "type": "text",
        "content": "You might want the login pop-up to show your app's name and logo, especially if you're preparing to launch your app publicly."
      },
      {
        "type": "text",
        "content": "In that case, you can connect your own setup with Google & Facebook (instead of using Apper's default shared connection)."
      },
      {
        "type": "text",
        "content": "It's a one-time setup and takes just a few minutes."
      },
      {
        "type": "text",
        "content": "Once it's done, just copy and paste the Client ID, Client Secret, and Callback URL from your setup into Apper. Here's how:"
      },
      {
        "heading": "Not sure which option to choose?",
        "type": "text",
        "content": "Start with the default as it works instantly. You can always switch to your own setup anytime."
      }
    ]
  },
  {
    "id": "onboarding-emails",
    "title": "Set Up Onboarding & Other Imp Emails for Your App 📧",
    "subtitle": "Built-in email system for user communication",
    "icon": "Mail",
    "sections": [
      {
        "type": "text",
        "content": "As users sign up and start using your app, you'll want to send them helpful emails to guide their journey (for confirming their email, or resetting a password, etc.)"
      },
      {
        "type": "text",
        "content": "Apper offers built-in support for creating and sending such system emails, so you don't need to connect any email service to get started."
      },
      {
        "heading": "Available Email Templates",
        "type": "list",
        "items": [
          "Email Confirmation – to verify a new user's email",
          "Reset Password – when someone forgets their login",
          "Invite User – to bring others into a team or workspace",
          "Subscription Receipt – after a successful payment",
          "Sign In with OTP – to send secure one-time login links"
        ]
      },
      {
        "type": "text",
        "content": "You can customize these templates to match your app's tone and branding — or create your own emails and sequences."
      }
    ]
  },
  {
    "id": "user-profiles-permissions",
    "title": "Manage User Profiles and Permissions 👥",
    "subtitle": "Control user access and organize your team",
    "icon": "Users",
    "sections": [
      {
        "type": "text",
        "content": "You can invite users, create profiles, and assign specific permissions to control access to tables and pages. This ensures that each user sees only what they need, keeping your data secure and organized."
      },
      {
        "heading": "User Management Features",
        "type": "list",
        "items": [
          "Create User Profiles – Set up detailed user accounts with roles and information",
          "Assign Permissions – Control what each user can view, edit, or delete",
          "Manage Team Access – Organize users into teams with specific access rights",
          "Secure Data Access – Ensure sensitive information is only visible to authorized users",
          "Role-Based Control – Define different permission levels for different user types"
        ]
      },
      {
        "heading": "💡 Best Practices",
        "type": "list",
        "items": [
"Start with basic roles and expand as needed",
          "Regularly review and update user permissions",
          "Use the principle of least privilege",
          "Train team leads on user management best practices"
        ]
      }
    ]
  },
  {
    "id": "billing-revenue",
    "title": "Billing and Revenue 💰",
    "subtitle": "Set up pricing, subscriptions, and payment collection",
    "icon": "CreditCard",
    "sections": [
      {
        "type": "text",
        "content": "You've built something great with Apper — now it's time to start earning from it. Whether it's a tool, course, or community, Apper makes it easy to set up pricing, offer subscriptions, and collect payments."
      },
      {
        "type": "text",
        "content": "To keep things flexible, the Billing & Revenue section is divided into three parts:"
      },
      {
        "type": "list",
        "items": [
          "Tiers & Plans: Your main pricing structure",
          "Addons / Credits – Extra features or pay-as-you-go upgrades",
          "Stripe Settings – for accepting real payments"
        ]
      },
      {
        "type": "text",
        "content": "Let's take a quick look at what each one does."
      },
      {
        "heading": "Tier and Plans",
        "type": "text",
        "content": "This is where you set up the core pricing options for your app. You can offer free plans, paid subscriptions, or both — and control what users get with each one."
      },
      {
        "heading": "Use this section to:",
        "type": "list",
        "items": [
          "Set pricing (monthly, yearly, or custom)",
          "Decide what each plan includes",
          "Add limits (like number of users or credits)"
        ]
      },
      {
        "heading": "Addons / Credits",
        "type": "text",
        "content": "Addons let users purchase extra features or resources without changing their main plan. This is great for things like:"
      },
      {
        "type": "list",
        "items": [
          "Additional AI credits",
          "Extra storage",
          "Bonus tools",
          "One-time unlocks"
        ]
      },
      {
        "type": "text",
        "content": "Perfect for apps that offer flexibility or usage-based pricing."
      },
      {
        "heading": "Stripe Settings",
        "type": "text",
        "content": "Connect your Stripe account to start accepting real payments — securely and automatically."
      },
      {
        "heading": "Stripe handles:",
        "type": "list",
        "items": [
"One-time and recurring transactions",
          "Subscription billing",
          "Invoices and payouts"
        ]
      }
    ]
  },
  {
    "id": "code-section",
    "title": "Code 💻",
    "subtitle": "Access and customize your app's code directly",
    "icon": "Code",
    "sections": [
      {
        "type": "text",
        "content": "Apper builds everything for you — from logic to layout — without needing you to write any code."
      },
      {
        "type": "text",
        "content": "But for advanced customizations, the Code section gives you direct access to the code that powers your app."
      },
      {
        "heading": "You can use this to:",
        "type": "list",
        "items": [
          "Make fine-tuned changes beyond the visual builder",
          "Add logic or custom functions manually",
          "Review or debug the generated code"
        ]
      },
      {
        "type": "text",
        "content": "This is especially useful for developers or technical users who want more control, or for those working with a developer on their team."
      },
      {
        "type": "text",
        "content": "Even though you don't need to use this section to launch your app, it's here if you want to take more control and customize things your way."
      }
    ]
  },
  {
    "id": "connect-database",
    "title": "Connect Database 🗄️",
    "subtitle": "Automatic data management and structure setup",
    "icon": "Database",
    "sections": [
      {
        "type": "text",
        "content": "Every app needs a place to store data — like user info, form submissions, orders, or messages. That's what the Database does."
      },
      {
        "type": "text",
        "content": "Apper creates and manages your database automatically based on how your app works, so you don't have to set anything up manually."
      },
      {
        "type": "text",
        "content": "Before Apper sets up your database, it asks you to choose your app type — so it knows how to organize your data properly."
      },
      {
        "heading": "You'll choose one of two options:",
        "type": "list",
        "items": [
          "Employee App – Each user sees only their own data",
          "Customer-Facing App – Each customer can have multiple users with shared access"
        ]
      },
      {
        "type": "text",
        "content": "This choice helps Apper set up the right structure and permissions behind the scenes — so your app behaves the way it should."
}
    ]
  }
]